<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"c7926b3de33c94ff618c389f9953ff0df0e62774961ca440874fa5416f9c2bc6","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1109 at https://github.com/cal-itp/data-infra/actions/runs/19868724533","plan_out_hash":"94dffe868de0b841276d772eff7f6f1f08aefa5f01ca137e27b9751627176746","plan_hash":"fc4e9170614f7cb54bbb4bb3ace7a8b495286e8e67764daf3995d073a55cd705","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "SgfazQ==" -> (known after apply)
!~      detect_md5hash      = "E5DwBoeO3WOBKVartOgJMw==" -> "different hash"
!~      generation          = 1764122315051550 -> (known after apply)
        id                  = "calitp-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "E5DwBoeO3WOBKVartOgJMw==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "0hDaaA==" -> (known after apply)
!~      detect_md5hash      = "XbhzfsiRlTt9goCn2BPzKg==" -> "different hash"
!~      generation          = 1764122315045275 -> (known after apply)
        id                  = "calitp-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "XbhzfsiRlTt9goCn2BPzKg==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "q2W/ig==" -> (known after apply)
!~      detect_md5hash      = "pebUFZJxFAXmLZDbts7AvA==" -> "different hash"
!~      generation          = 1764122315043472 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "pebUFZJxFAXmLZDbts7AvA==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "gUkeBw==" -> (known after apply)
!~      detect_md5hash      = "29ltAjk4ZC7nudhaIAsmFA==" -> "different hash"
!~      generation          = 1764122315043811 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "29ltAjk4ZC7nudhaIAsmFA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "u30a+g==" -> (known after apply)
!~      detect_md5hash      = "VRdUPDJwUQDirad658UFYw==" -> "different hash"
!~      generation          = 1764122315040498 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "VRdUPDJwUQDirad658UFYw==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "/vB9ww==" -> (known after apply)
!~      detect_md5hash      = "xJoMFkOgFmaH9vQDF3rcAQ==" -> "different hash"
!~      generation          = 1764122315039512 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "xJoMFkOgFmaH9vQDF3rcAQ==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "00iJ/w==" -> (known after apply)
!~      detect_md5hash      = "yfkZas/eBQMAqfz2eXnuDw==" -> "different hash"
!~      generation          = 1764100054963994 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "yfkZas/eBQMAqfz2eXnuDw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "S9xfig==" -> (known after apply)
!~      detect_md5hash      = "GEAgWaMaB3xMcxPCFeJXSg==" -> "different hash"
!~      generation          = 1764100056657852 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GEAgWaMaB3xMcxPCFeJXSg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1109](https://github.com/cal-itp/data-infra/actions/runs/19868724533)